{"pageProps":{"index":{"id":"0002","content":"<pre><code>EEP: 2\nTitle: Sample Plaintext PEP Template\nVersion: $Revision$\nLast-Modified: $Date$\nAuthor: Per Gustafsson &lt;pergu(at)it(dot)uu(dot)se&gt;\nStatus: Final/R-33 Replaced by EEP 33\nType: Process\nContent-Type: text/plain\nCreated: 14-Aug-2001\nPost-History:\nReplaced-By: 33\n\n\nAbstract\n\n    This EEP provides a boilerplate or sample template for creating\n    your own plaintext EEPs. In conjunction\n    with the content guidelines in EEP 1 [1], this should make it easy\n    for you to conform your own EEPs to the format outlined below.\n\n    Note: if you are reading this EEP via the web, you should first\n    grab the plaintext source of this EEP in order to complete the\n    steps below.  DO NOT USE THE HTML FILE AS YOUR TEMPLATE!\n\n    If you would prefer to use lightweight markup in your EEP, please\n    see EEP 3, \"Sample reStructuredText EEP Template\" [2].\n\n    This document is based on PEP 9 [3].\n\n\nRationale\n\n    EEP submissions come in a wide variety of forms, not all adhering\n    to the format guidelines set forth below.  Use this template, in\n    conjunction with the content guidelines in EEP 1, to ensure that\n    your EEP submission won't get automatically rejected because of\n    form.\n\n\nHow to Use This Template\n\n    To use this template you must first decide whether your EEP is\n    going to be an Informational or Standards Track EEP.  Most EEPs\n    are Standards Track because they propose a new feature for the\n    Erlang language or standard library.  When in doubt, read EEP 1\n    for details or contact the EEP editors &lt;eeps@erlang.org&gt;.\n\n    Once you've decided which type of EEP yours is going to be, follow\n    the directions below.\n\n    - Make a copy of this file (.txt file, not HTML!) and perform the\n      following edits.\n\n    - Replace the \"EEP: 2\" header with \"EEP: XXX\" since you don't yet\n      have an EEP number assignment.\n\n    - Change the Title header to the title of your EEP.\n\n    - Leave the Version and Last-Modified headers alone; we'll take\n      care of those when we check your EEP into the Subversion\n      repository.  These headers consist of keywords (\"Revision\" and\n      \"Date\" enclosed in \"$\"-signs) which are automatically expanded\n      by the repository.  Please do not edit the expanded date or\n      revision text.\n\n    - Change the Author header to include your name, and optionally\n      your email address.  Be sure to follow the format carefully:\n      your name must appear first, and it must not be contained in\n      parentheses.  Your email address may appear second (or it can be\n      omitted) and if it appears, it must appear in angle brackets.\n      It is okay to obfuscate your email address.\n\n    - If there is a mailing list for discussion of your new feature,\n      add a Discussions-To header right after the Author header.  You\n      should not add a Discussions-To header if the mailing list to be\n      used is erlang-questions@erlang.org, or if discussions should be\n      sent to you directly.  Most Informational EEPs don't have a\n      Discussions-To header.\n\n    - Change the Status header to \"Draft\".\n\n    - For Standards Track EEPs, change the Type header to \"Standards\n      Track\".\n\n    - For Informational EEPs, change the Type header to\n      \"Informational\".\n\n    - For Standards Track EEPs, if your feature depends on the\n      acceptance of some other currently in-development EEP, add a\n      Requires header right after the Type header.  The value should\n      be the EEP number of the EEP yours depends on.  Don't add this\n      header if your dependent feature is described in a Final EEP.\n\n    - Change the Created header to today's date.  Be sure to follow\n      the format carefully: it must be in dd-mmm-yyyy format, where\n      the mmm is the 3 English letter month abbreviation, e.g. one of\n      Jan, Feb, Mar, Apr, May, Jun, Jul, Aug, Sep, Oct, Nov, Dec.\n\n    - For Standards Track EEPs, after the Created header, add a\n      Erlang-Version header and set the value to the next planned\n      version of Erlang, i.e. the one your new feature will hopefully\n      make its first appearance in.  Thus, if the last version of\n      Erlang/OTP was R11B-3 and you're hoping to get your new feature\n      into R11B-4 set the version header to:\n\n      Erlang-Version: R11B-4\n\n    - Leave Post-History alone for now; you'll add dates to this\n      header each time you post your EEP to\n      erlang-questions@erlang.org. E.g. if you posted your EEP to the\n      list on August 14, 2006 and September 3, 2006, the Post-History\n      header would look like:\n\n      Post-History: 14-Aug-2006, 03-Sept-2006\n\n      You must manually add new dates and check them in.  If you don't\n      have check-in privileges, send your changes to the EEP editor.\n\n    - Add a Replaces header if your EEP obsoletes an earlier EEP.  The\n      value of this header is the number of the EEP that your new EEP\n      is replacing.  Only add this header if the older EEP is in\n      \"final\" form, i.e. is either Accepted, Final, or Rejected.  You\n      aren't replacing an older open EEP if you're submitting a\n      competing idea.\n\n    - Now write your Abstract, Rationale, and other content for your\n      EEP, replacing all this gobbledygook with your own text.  Be sure\n      to adhere to the format guidelines below, specifically on the\n      prohibition of tab characters and the indentation requirements.\n\n    - Update your References and Copyright section.  Usually you'll\n      place your EEP into the public domain, in which case just leave\n      the \"Copyright\" section alone.  Alternatively, you can use the\n      Open Publication License[4], but public domain is still strongly\n      preferred.\n\n    - Leave the little Emacs turd at the end of this file alone,\n      including the formfeed character (\"^L\", or \\f).\n\n    - Send your EEP submission to the EEP editors (eeps@erlang.org),\n      (Funny Joke removed :)\n\n\nPlaintext EEP Formatting Requirements\n\n    EEP headings must begin in column zero and the initial letter of\n    each word must be capitalized as in book titles.  Acronyms should\n    be in all capitals.  The body of each section must be indented 4\n    spaces.  Code samples inside body sections should be indented a\n    further 4 spaces, and other indentation can be used as required to\n    make the text readable.  You must use two blank lines between the\n    last line of a section's body and the next section heading.\n\n    You must adhere to the Emacs convention of adding two spaces at\n    the end of every sentence.  You should fill your paragraphs to\n    column 70, but under no circumstances should your lines extend\n    past column 79.  If your code samples spill over column 79, you\n    should rewrite them.\n\n    Tab characters must never appear in the document at all.  An EEP\n    should include the standard Emacs stanza included by example at\n    the bottom of this EEP.\n\n    When referencing an external web page in the body of an EEP, you\n    should include the title of the page in the text, with a\n    footnote reference to the URL.  Do not include the URL in the body\n    text of the EEP.  E.g.\n\n        Refer to the Erlang Language web site [1] for more details.\n        ...\n        [1] http://www.erlang.org\n\n    When referring to another EEP, include the EEP number in the body\n    text, such as \"EEP 1\".  The title may optionally appear.  Add a\n    footnote reference, a number in square brackets.  The footnote\n    body should include the EEP's title and author.  It may optionally\n    include the explicit URL on a separate line, but only in the\n    References section.  Note that the eep2html.py script will\n    calculate URLs automatically.  For example:\n\n            ...\n            Refer to EEP 1 [7] for more information about EEP style\n            ...\n\n        References\n\n            [7] EEP 1, EEP Purpose and Guidelines, Gustafsson\n                http://www.erlang.org/eeps/eep-0001.html\n\n    If you decide to provide an explicit URL for an EEP, please use\n    this as the URL template:\n\n        http://www.erlang.org/eeps/eep-xxxx.html\n\n    EEP numbers in URLs must be padded with zeros from the left, so as\n    to be exactly 4 characters wide, however EEP numbers in the text\n    are never padded.\n\n\nReferences\n\n    [1] EEP 1, EEP Purpose and Guidelines, Gustafsson\n        http://www.erlang.org/eeps/eep-0001.html\n\n    [2] EEP 3, Sample reStructuredText EEP Template, Gustafsson\n        http://www.erlang.org/eeps/eep-0003.html\n\n    [3] PEP 9, Sample Plaintext PEP Template, Warsaw\n        http://www.python.org/dev/peps/pep-0009/\n\n    [4] http://www.opencontent.org/openpub/\n\n\n\nCopyright\n\n    This document has been placed in the public domain.\n\n\n\nLocal Variables:\nmode: indented-text\nindent-tabs-mode: nil\nsentence-end-double-space: t\nfill-column: 70\ncoding: utf-8\nEnd:\n</code></pre>\n"}},"__N_SSG":true}