{"pageProps":{"index":{"id":"0033","content":"<pre><code>Author: Raimo Niskanen &lt;raimo(at)erlang(dot)org&gt;\nStatus: Active\nType: Process\nCreated: 31-Mar-2010\nPost-History:\nReplaces: 2, 3\n</code></pre>\n\n<hr />\n\n<h2><a href=\"/eeps/eep-0000\" title=\"EEP Index\">EEP</a> 33: <a href=\"eep-0033.md\" title=\"EEP Source\"> Sample Markdown EEP Template</a></h2>\n\n<h1>Abstract</h1>\n\n<p>This EEP provides a boilerplate or sample template for creating your own\n<a href=\"http://daringfireball.net/projects/markdown/\" title=\"Markdown Home Page\">Markdown</a> EEPs. In conjunction with the content guidelines in <a href=\"/eeps/eep-0001\" title=\"EEP Purpose and Guidelines, Gustafsson\">EEP 1</a>,\nthis should make it easy for you to conform your own EEPs to the format\noutlined below.</p>\n\n<blockquote>\n  <p>Note: if you are reading this EEP via the web, you should first\ngrab the plaintext <a href=\"eep-0033.md\" title=\"EEP Source\">source of this EEP</a> in order to complete the\nsteps below.  DO NOT USE THE HTML FILE AS YOUR TEMPLATE!</p>\n</blockquote>\n\n<p>This document is based on <a href=\"http://www.python.org/dev/peps/pep-0009/\" title=\"Sample Plaintext PEP Template, Warsaw\">PEP 9</a>.</p>\n\n<h1>Rationale</h1>\n\n<p>EEP submissions come in a wide variety of forms, not all adhering to the\nformat guidelines set forth below.  Use this template, in conjunction with\nthe content guidelines in <a href=\"/eeps/eep-0001\" title=\"EEP Purpose and Guidelines, Gustafsson\">EEP 1</a>, to ensure that your EEP submission\nwon't get automatically rejected because of form.</p>\n\n<h1>How to Use This Template</h1>\n\n<p>To use this template you must first decide whether your EEP is going to be\nan Process or Standards Track EEP.  Most EEPs are Standards Track because\nthey propose a new feature for the Erlang language or standard library.\nWhen in doubt, read <a href=\"/eeps/eep-0001\" title=\"EEP Purpose and Guidelines, Gustafsson\">EEP 1</a> for details or contact the EEP editors\n<a href=\"m&#x61;&#105;&#x6C;t&#x6F;:&#101;e&#112;&#x73;&#64;&#101;&#x72;&#108;a&#x6E;g&#x2E;&#111;&#114;g\">&#101;e&#112;&#x73;&#64;&#101;&#x72;&#108;a&#x6E;g&#x2E;&#111;&#114;g</a>.</p>\n\n<p>Once you've decided which type of EEP yours is going to be, follow the\ndirections below.</p>\n\n<ul>\n<li><p>Make a copy of <a href=\"eep-0033.md\" title=\"EEP Source\">this file</a> (.md file, not HTML!) and perform the\nfollowing edits.</p></li>\n<li><p>Replace the \"EEP 33: \" header with \"EEP XXX: \" and the title of your EEP,\ni.e use 'XXX' until you have an assigned EEP number.</p></li>\n<li><p>Change the Author header to include your name, and optionally your\nemail address.  Be sure to follow the format carefully: your name\nmust appear first, and it must not be contained in parentheses.\nYour email address may appear second (or it can be omitted) and if\nit appears, it must appear in angle brackets.  It is recommended\nto obfuscate your email address. The authors can be a comma separated\nlist in which the last author is the EEP owner.</p></li>\n<li><p>If there is a mailing list for discussion of your new feature, add\na Discussions-To header right after the Author header.  You should\nnot add a Discussions-To header if the mailing list to be used is\n<a href=\"&#x6D;&#97;&#105;&#x6C;&#116;&#x6F;:&#x65;&#114;l&#97;&#110;&#103;&#x2D;&#113;&#117;&#101;&#x73;&#x74;&#105;&#x6F;&#110;&#115;&#64;e&#114;&#x6C;&#x61;&#x6E;&#103;.&#x6F;&#x72;&#x67;\">&#x65;&#114;l&#97;&#110;&#103;&#x2D;&#113;&#117;&#101;&#x73;&#x74;&#105;&#x6F;&#110;&#115;&#64;e&#114;&#x6C;&#x61;&#x6E;&#103;.&#x6F;&#x72;&#x67;</a>, or if discussions should be sent to\nyou directly.  Most Process EEPs don't have a Discussions-To header.</p></li>\n<li><p>Change the Status header to \"Draft\".</p></li>\n<li><p>For Standards Track EEPs, change the Type header to \"Standards Track\".</p></li>\n<li><p>For Process EEPs, change the Type header to \"Process\".</p></li>\n<li><p>For Standards Track EEPs, if your feature depends on the acceptance\nof some other currently in-development EEP, add a Requires header right\nafter the Type header.  The value should be the EEP number of the EEP\nyours depends on.  Don't add this header if your dependent feature is\ndescribed in a Final EEP.</p></li>\n<li><p>Change the Created header to today's date.  Be sure to follow the format\ncarefully: it must be in dd-mmm-yyyy format, where the mmm is the\n3 English letter month abbreviation, e.g. one of Jan, Feb, Mar, Apr,\nMay, Jun, Jul, Aug, Sep, Oct, Nov, Dec.</p></li>\n<li><p>For Standards Track EEPs, after the Created header, add a Erlang-Version\nheader and set the value to the next planned version of Erlang, i.e.\nthe one your new feature will hopefully make its first appearance in.\nThus, if the last version of Erlang/OTP was R13B-3 and you're hoping\nto get your new feature into R13B-4 set the version header to:</p>\n\n<pre><code>Erlang-Version: R13B-4\n</code></pre></li>\n<li><p>Leave Post-History alone for now; you'll add dates to this header each\ntime you post your EEP to <a href=\"&#109;&#x61;&#105;&#108;t&#x6F;:&#101;&#x72;&#108;&#x61;&#x6E;&#x67;&#x2D;q&#x75;e&#x73;&#116;&#x69;o&#x6E;&#115;&#64;&#101;&#114;&#x6C;&#x61;&#x6E;&#103;.&#x6F;&#114;&#x67;\">&#101;&#x72;&#108;&#x61;&#x6E;&#x67;&#x2D;q&#x75;e&#x73;&#116;&#x69;o&#x6E;&#115;&#64;&#101;&#114;&#x6C;&#x61;&#x6E;&#103;.&#x6F;&#114;&#x67;</a>.  E.g. if you\nposted your EEP to the list on August 14, 2009 and September 3, 2009,\nthe Post-History header would look like:</p>\n\n<pre><code>Post-History: 14-Aug-2009, 03-Sept-2009\n</code></pre>\n\n<p>You must manually add new dates and check them in.  If you don't have\ncheck-in privileges, send your changes to the EEP editor.</p></li>\n<li><p>Add a Replaces header if your EEP obsoletes an earlier EEP.  The value\nof this header is the number of the EEP that your new EEP is replacing.\nOnly add this header if the older EEP is in \"final\" form, i.e. is either\nAccepted, Final, or Rejected.  You aren't replacing an older open EEP\nif you're submitting a competing idea.</p></li>\n<li><p>Now write your Abstract, Rationale, and other content for your EEP,\nreplacing all this gobbledygook with your own text.  Be sure to adhere\nto the format guidelines below, specifically on the prohibition of tab\ncharacters and the indentation requirements.</p></li>\n<li><p>Update your References and Copyright section.  Usually you'll place\nyour EEP into the public domain, in which case just leave the \"Copyright\"\nsection alone.  Alternatively, you can use the <a href=\"http://www.opencontent.org/openpub/\" title=\"Open Publication License\">Open Publication\nLicense</a> or the <a href=\"http://creativecommons.org/licenses/by/3.0/\" title=\"Creative Commons Attribution 3.0 License\">Creative Commons Attributions 3.0 License</a>,\nbut public domain is still strongly preferred.</p></li>\n<li><p>Leave the little <a href=\"http://www.gnu.org/software/emacs/manual/html_node/emacs/Specifying-File-Variables.html\" title=\"Specifying local file variables for Emacs\">Emacs turd</a> at the end of this file alone, with it\nyou get a good mode and character encoding, and can e.g fix a\nparagraph using <code>fill-paragraph</code> (default <code>[ESC] q</code>).</p></li>\n<li><p>Send your EEP submission to the EEP editors <a href=\"m&#x61;&#105;&#108;&#x74;&#111;:&#101;e&#x70;&#115;&#64;&#x65;&#114;&#108;&#97;&#x6E;&#103;&#46;&#x6F;&#114;&#x67;\">&#101;e&#x70;&#115;&#64;&#x65;&#114;&#108;&#97;&#x6E;&#103;&#46;&#x6F;&#114;&#x67;</a>.</p></li>\n</ul>\n\n<h1>Markdown EEP Formatting Requirements</h1>\n\n<p>See the <a href=\"http://daringfireball.net/projects/markdown/\" title=\"Markdown Home Page\">Markdown</a> Syntax for general formatting syntax.  On top of\nthis Markdown EEPs has these requirements:</p>\n\n<p>The first lines of the EEP is for EEP index generator parsing and the\nMarkdow preprocessing so it must look like the first 10 lines of\n<a href=\"eep-0033.md\" title=\"EEP Source\">this file</a>, with that specific style of horizontal rule\nand header 2 title.  Your EEP may have more or less header lines.</p>\n\n<p>EEP toplevel headings are type H1 i.e <code>====</code> underlined.  The initial\nletter of each word must be capitalized as in book titles.</p>\n\n<p>Acronyms should be in all capitals.</p>\n\n<p>Code samples inside sections should be indented 4 spaces.</p>\n\n<p>You must use three blank lines before all H1 headings, and two before\nall H2 headings.</p>\n\n<p>You must adhere to the Emacs convention of adding two spaces at the\nend of every sentence.  You should fill your paragraphs to column 70,\nbut under no circumstances should your lines extend past column 79.\nIf your code samples spill over column 79, you should rewrite them.</p>\n\n<p>Tab characters must never appear in the document at all.</p>\n\n<p>When referencing an external web page in the body of an EEP, you\nshould include the title of the page in the text, with a footnote\nreference to the URL.  Do not include the URL in the body text of the\nEEP.  E.g:</p>\n\n<pre><code>Refer to the [Erlang Language web site][1] for more details.\n\n:\n\n[1]: http://www.erlang.org\n    \"Erlang Programming Language\"\n</code></pre>\n\n<p>Footnote reference definitions should be placed second last in the\ndocument, right before the \"Copyright\" section and the Emacs magic.\nNote that these references are invisible in the by <a href=\"http://daringfireball.net/projects/markdown/\" title=\"Markdown Home Page\">Markdown</a>\ngenerated HTML.</p>\n\n<p>When referring to another EEP, include the EEP number in the body text\nusing an implicit link name footnote, such as <code>[EEP 1][]</code>.  The title\nmay optionally appear.  The footnote body should include the EEP's\ntitle and author, and it should refer to its URL.</p>\n\n<blockquote>\n  <p>NOTE: The URL is relative to the current URL and the build \ntools will fix it to point to the .html file.</p>\n</blockquote>\n\n<p>Example:</p>\n\n<pre><code>Refer to [EEP 1][] for more information about EEP style\n\n:\n\n[EEP 1]: eep-0001.md\n    \"EEP 1, EEP Purpose and Guidelines, Gustafsson\"\n</code></pre>\n\n<p>EEP numbers in URLs must be padded with zeros from the left, so as to\nbe exactly 4 characters wide, however EEP numbers in the text are\nnever padded.</p>\n\n<h1>Copyright</h1>\n\n<p>This document has been placed in the public domain.</p>\n"}},"__N_SSG":true}