{"pageProps":{"links":"\n## On-line documentation\n\n***\n* [Erlang/OTP Documentation](erldoc)  \n  Online documentation for the latest version of the run-time system as well as all the libraries.\n              \n* [Erlang/OTP Documentation (No Search)](doc/)  \n  Online documentation for the latest version of the run-time system as well as all the libraries.\n              \n* [Erldocs](http://Erldocs.com)  \n  Erldocs.com is a searchable alternative to the Erlang/OTP documentation, though only module reference documentation confusingly even on many undocumented modules.\n              \n* [Erlang Reference Manual - User's Guide](doc/reference_manual/users_guide.html)  \n  A user’s guide System principles and efficiency guide.\n              \n* [Efficiency Guide - User's Guide](doc/efficiency_guide/users_guide.html)  \n  A guide that teaches you what to use and what to avoid in Erlang, as well as how certain Erlang features are implemented.\n              \n* [System Principles - User's Guide](doc/system_principles/system_principles.html)  \n  A guide on a number of Erlang system principles.\n              \n* [OTP Design Principles - User’s Guide](doc/design_principles/users_guide.html)  \n  The OTP design principles define how to structure Erlang code in terms of processes, modules, and directories.\n              \n* [OTP Versions Tree](download/otp_versions_tree.html)  \n  All released OTP versions since OTP 17.0, with links to GitHub source tags and to README:s. As of OTP 23, Windows installers for all patches can be downloaded from here as well.\n              \n## Erlang books\n***\n              \n* [Programming Erlang: Software for a Concurrent World](download/erlang-book-part1.pdf)  \n  Programming Erlang: Software for a Concurrent World (Joe Armstrong) is a book about Erlang written by one of the original inventors, published in 2007. You can buy it on paper from Amazon and other online bookstores, or directly from the publisher.\n              \n* [Learn You Some Erlang for Great Good!](http://learnyousomeerlang.com/)  \n  Learn You Some Erlang for Great Good! by Fred Hebert is a beginner's book about Erlang, published in 2013. It is available in paper copies and online.\n              \n* [Erlang Programming](http://shop.oreilly.com/product/9780596518189.do)  \n  Erlang Programming (A Concurrent Approach to Software Development) by Francesco Cesarini and Simon Thompson was published in 2009. Get it from Amazon etc or directly from the publisher.\n              \n* [Erlang and OTP in Action](https://www.manning.com/books/erlang-and-otp-in-action)  \n  Erlang and OTP in Action by Martin Logan, Eric Merritt and Richard Carlsson was published in 2010. You can buy it from various online bookstores, or directly from the publisher.\n              \n* [Introducing Erlang](http://shop.oreilly.com/product/0636920025818.do)  \n  Introducing Erlang by Simon St. Laurent, 2013, is an introduction to Erlang for beginners. It is available directly from the publisher.\n              \n* [Designing for Scalability with Erlang/OTP](//shop.oreilly.com/product/0636920024149.do)  \n  With this hands-on book, you’ll learn how to apply OTP libraries and techniques to develop concurrent, fault-tolerant systems with no single point of failure.\n              \n## Papers\n***\n              \n* [Making reliable distributed systems in the presence of software errors](download/armstrong_thesis_2003.pdf)  \n  PhD thesis of Joe Armstrong, Erlang’s co-inventor, describing the origins of Erlang.\n"},"__N_SSG":true}